In [20]:
import pandas as pd
import numpy as np

### *Read the csv and put on a Dataframe*

In [21]:
df = pd.read_csv("/content/property data.csv")

### *Show the first 7 rows of the dataframe to gain a better understanding of the data.*

In [22]:
print(df.head(7))

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950

a simple explaination of the data:

*   ST_NUM: Street Number
*   St_NAME: Street Name
*   OWN_OCCUPIED: Y stands for
    ('Yes') and N for ('No')
*   NUM_BEDROOMS: integers
*   NUM_BATH:Float
*   SQ_FT: Integers

In [23]:
print(df[['ST_NUM','NUM_BATH']])

   ST_NUM NUM_BATH
0   104.0        1
1   197.0      1.5
2     NaN        1
3   201.0      NaN
4   203.0        2
5   207.0        1
6     NaN   HURLEY
7   213.0        1
8   215.0        2

test the pandas's function isnull()

In [24]:
print(df[['ST_NUM','NUM_BATH']].isnull())

   ST_NUM  NUM_BATH
0   False     False
1   False     False
2    True     False
3   False      True
4   False     False
5   False     False
6    True     False
7   False     False
8   False     False

The isnull() function only interprecting someg values as missing values: NA, na, n/a, NaN, None, NaT. empty...

*We can create a list to identify the missing values left on the sidelines by using the *'na_values'* optionin the *'read_csv'* function of Pandas üêº. This allows us to easily detect and handle missing values during the data import process.*

In [25]:
Missing_Values = ["n/a","a", "--"]
df = pd.read_csv("property data.csv", na_values = Missing_Values)

In [26]:
print(df.head(7))

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000.0
1  100002000.0   197.0   LEXINGTON            N            3      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12            1      NaN   700.0
4          NaN   203.0    BERKELEY            Y            3        2  1600.0
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950.0

In the row 'OWN_OCCUPIED' the missing values, not integers: 12

In [27]:
for index, row in df.iterrows():
    if row['OWN_OCCUPIED'] not in ['Y', 'N']:
        df.loc[index, 'OWN_OCCUPIED'] = np.nan

The iterrows() function in Pandas allows parsing of each cell in the DataFrame.

Using the loc function in Pandas, we can replace any unexpected elements (not 'Y' or 'N') with NaN using the np.nan function from NumPy.

In [28]:
print(df['OWN_OCCUPIED'])

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

We can observe that the value '12' in index 3  and row 'OWN_OCCUPIED' became
'NaN'.

Similarly, we can notice that the **'NUM_BATH'** column has the same issue, as

only floating-point numbers are accepted.

In [29]:
index = 0
for row in df['NUM_BATH']:
  try:
    float(row)
  except ValueError:
    df.loc[index, 'NUM_BATH'] = np.nan
  index += 1

I have decided to use exception handling (try and except ValueError) to handle errors. As a result, all missing values in the DataFrame are now properly handled.

In [30]:
print(df.head(8))

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000.0
1  100002000.0   197.0   LEXINGTON            N            3      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850.0
3  100004000.0   201.0    BERKELEY          NaN            1      NaN   700.0
4          NaN   203.0    BERKELEY            Y            3        2  1600.0
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN            2      NaN   950.0
7  100008000.0   213.0     TREMONT            Y            1        1     NaN